User-focused tool for interacting with ORCM.  This tool has the ability to run as an interactive shell or as a single one-shot command.  Currently the tools provides information about configured resources, sessions, and queues.  The tool is also for managing sessions at the user level. 

###3.6.1 Interactive CLI
The interactive mode of the CLI is invoked by running the command without any subcommands.  Optional arguments such as MCA parameters can be specified as well.

```
% ocli
*** WELCOME TO OCLI ***
 Possible commands:
   resource             Resource Information
   queue                Queue Information
   session              Session Management
ocli> 
```

Once in the interactive shell, the `<tab>` key can be used to either autocomplete unambiguous partial commands or list possible completions for ambiguous partial commands.  The `<?>` key will display more information about all of the commands at the current hierarchy.

For example, pressing `<tab>` after entering `res` will autocomplete the `resource` command, and pressing `<tab>` after the `resource` command is fully entered, will show:
```
ocli> resource 
	status availability
ocli> resource
```

As another example, pressing `<?>` after entering `queue`, will show:
```
ocli> queue 
Possible commands:
   status               Queue Status
   policy               Queue Policies

ocli> queue
```

Notice how in both cases, control is returned to the user to complete the command as desired.

In the following sections, examples for each command will be given using normal one-shot execution mode.  However, they can also be executed in interactive mode.

###3.6.2 Resource
The resource command set is used to display information about the resources (nodes) configured in the system.  The current implementation displays the node connection state (either up or down) and the job state (allocated or unallocated).  The node specification is an ORCM node regex.

Example:
```
% ocli resource status
TOTAL NODES : 10
NODES                : STATE  SCHED_STATE
-----------------------------------------
node001              : â†‘      UNALLOCATED
node[3:2-10]         : ?            UNDEF
```

###3.6.3 Queue
The queue command set displays information about the currently configured queues as well as the sessions within each queue.  The current scheduler defines 3 queues: running, hold, and default.  All sessions get placed initially in the default queue.  As the scheduler launches the sessions they will be placed on the running queue.  And session that tries to allocation invalid resource definitions will be placed on the hold queue with a string describing the error.

The session information displays:

&lt;session-id&gt; &lt;userid|grouid&gt; &lt;number of nodes requested&gt; &lt;EXclusve or SHared&gt; &lt;Batch or Interactive&gt;

Example:
```
% ocli queue status
********
QUEUES
********
running (1 sessions)
----------
1	502|20	1	EX	B	
hold (0 sessions)
----------
default (2 sessions)
----------
2	502|20	5	SH	B	
3	502|20	2	EX	B	
```

###3.6.4 Session
The session command set is used to modify submitted sessions.  Currently the only modification supported is canceling the session.  If the sessions is in the default queue waiting to run, canceling the session will remove it from the queue.  If the session is running, then canceling the session will terminate the running jobs and end the session.  The session cancel command takes a session-id as a required argument.

Example:
```
% ocli session cancel 1
Success
% ocli queue status
********
QUEUES
********
running (0 sessions)
----------
hold (0 sessions)
----------
default (2 sessions)
----------
2	502|20	5	SH	B	
3	502|20	2	EX	B
```